import time

def intro():
    print("Ви знаходитесь в маленькому містечку, де живуть діти з різними характерами.")
    print("Ваше завдання - взяти участь у житті цього містечка та приймати важливі рішення.")
    print("Ваші рішення впливатимуть на те, якими стануть ці діти у майбутньому.")
    print("Чи зможете ви виховати їх добрими чи поганими?")

def decision():
    print("\nВаш перший вибір:")
    print("1. Дати поганому хлопчикові шанс і спробувати його переконати.")
    print("2. Відмовити і вигнати його з містечка.")

    choice = input("Ваш вибір (1/2): ")
    
    if choice == "1":
        print("Ви намагаєтеся вплинути на поганого хлопчика, спробувати виховати його на краще.")
        time.sleep(2)
        print("Час покаже, чи це було правильне рішення.")
    elif choice == "2":
        print("Ви відмовили поганому хлопчику і вигнали його з містечка.")
        time.sleep(2)
        print("Інші діти залишилися в безпеці, але це був важкий вибір.")
    else:
        print("Виберіть 1 або 2.")
        decision()

def main():
    intro()
    decision()

if __name__ == "__main__":
    main()
