user= {
    "ID": 22,
    "прізвище": "Германюк",
    "Ім’я": "Андрій",
    "Група": "ІПЗс-23-2",
    "Курс": 1,
    "Книги (борг)": [],
    "Статистика книг": []
}
while True:
    print("\nМеню:")
    print("1 - Показати карту читача")
    print("2 - Взяти книгу в борг")
    print("3 - Повернути книгу в бібліотеку")
    print("0 - Вихід")
    a = input("Виберіть опцію: ")
    if a == "1":
        print("Карта читача:")
        for key, value in user.items():
            if key not in ["Книги (борг)", "Статистика книг"]:
                print(f"{key}: {value}")
    elif a == "2":
        b = input("Введіть назву книги, щоб взяти в борг: ")
        user["Книги (борг)"].append(b)
        print(f"Книга '{b}' додана в борг.")
    elif a == "3":
        if user["Книги (борг)"]:
            print("Список книг у боргу:")
            for b in user["Книги (борг)"]:
                print(b)
            b = input("Введіть назву книги, котру треба повернути: ")
            if b in user["Книги (борг)"]:
                user["Книги (борг)"].remove(b)
                user["Статистика книг"].append(b)
                print(f"Книга '{b}' повернута.")
            else:
                print(f"Книги '{b}' немає в боргу.")
        else:
            print("Боргу немає.")
    elif a == "0":
        break
    else:
        print("Помилка. Спробуйте ще раз.")